EDT/УТ/src/Documents/ВводДанныхГСМ/ВводДанныхГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводДанныхГСМ</name>
  <registerRecords>AccumulationRegister.РасходГСМ</registerRecords>
  <registerRecords>InformationRegister.СтоимостьГСМ</registerRecords>
  <registerRecords>InformationRegister.ВводДанныхОРасходахКомпании</registerRecords>
  <attributes>
    <name>ДатаОтчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>DocumentRef.Рейс</types>
      </type>
    </attributes>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>CatalogRef.новаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходГСМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказанияОдометраНаНачалоДня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказанияОдометраНаКонецДня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтоимостьГСМ</name>
    <attributes>
      <name>ТипГСМ</name>
      <type>
        <types>CatalogRef.ТипыГСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/РасходГСМ/РасходГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасходГСМ</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>РасходГСМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЗатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПоказанияОдометраНаНачалоДня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказанияОдометраНаКонецДня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/InformationRegisters/СтоимостьГСМ/СтоимостьГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтоимостьГСМ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипГСМ</name>
    <type>
      <types>CatalogRef.ТипыГСМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ВводДанныхОРасходахКомпании/ВводДанныхОРасходахКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВводДанныхОРасходахКомпании</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Юрлицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатратКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗатрат</name>
    <type>
      <types>EnumRef.ВидыЗатратКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗатрат</name>
    <type>
      <types>EnumRef.ТипыЗатрат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ВидыЗатратКомпании/ВидыЗатратКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗатратКомпании</name>
  <enumValues>
    <name>ПрямыеРасходы</name>
  </enumValues>
  <enumValues>
    <name>РаспределяемыеРасходы</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/СтатьиЗатратКомпании/СтатьиЗатратКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиЗатратКомпании</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПрямыеРасходы</name>
      <description>Прямые расходы</description>
    </items>
    <items>
      <name>РаспределяемыеРасходы</name>
      <description>Распределяемые расходы</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидРасходов</name>
    <type>
      <types>EnumRef.ВидыЗатратКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗатрат</name>
    <type>
      <types>EnumRef.ТипыЗатрат</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Documents/ВводДанныхГСМ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ЦенаГСМ = 0;
	
	// регистр РасходГСМ 
	Движения.РасходГСМ.Записывать = Истина;
	Движения.РасходГСМ.Очистить();
	Для Каждого ТекСтрокаТранспорт Из Транспорт Цикл
		
		Движение = Движения.РасходГСМ.Добавить();
		Движение.Период = ДатаОтчета;
		Движение.Рейс = ТекСтрокаТранспорт.Рейс;
		Движение.Транспорт = ТекСтрокаТранспорт.Транспорт;
		Движение.ТерминалДоставки = ТерминалДоставки;
		Движение.Водитель = ТекСтрокаТранспорт.Водитель;
		Движение.РасходГСМ = ТекСтрокаТранспорт.РасходГСМ;
		Движение.ПоказанияОдометраНаНачалоДня = ТекСтрокаТранспорт.ПоказанияОдометраНаНачалоДня;
		Движение.ПоказанияОдометраНаКонецДня = ТекСтрокаТранспорт.ПоказанияОдометраНаКонецДня;
		
		ТипГСМ = ТекСтрокаТранспорт.Транспорт.Марка.ТипГСМ;
		МасСтоимостьГСМ = ЭтотОбъект.СтоимостьГСМ.НайтиСтроки(Новый Структура("ТипГСМ", ТипГСМ));
		Если МасСтоимостьГСМ.Количество() Тогда	
			ЦенаГСМ = МасСтоимостьГСМ[0].Стоимость;		
		КонецЕсли;		
		Движение.СуммаЗатрат = ТекСтрокаТранспорт.РасходГСМ * ЦенаГСМ;
		
	КонецЦикла;
	
	
	
	// РН СтоимостьГСМ
	Движения.СтоимостьГСМ.Записывать = Истина;
	Движения.СтоимостьГСМ.Очистить();
	Для каждого Стр Из СтоимостьГСМ Цикл		
		Движение = Движения.СтоимостьГСМ.Добавить();
		Движение.Период = ДатаОтчета;
		Движение.ТерминалДоставки = ТерминалДоставки;
		Движение.ТипГСМ = Стр.ТипГСМ;
		Движение.Стоимость = Стр.Стоимость;			
	КонецЦикла;
	
	
	
	// РН ВводДанныхОРасходахКомпании	
	Движения.ВводДанныхОРасходахКомпании.Записывать = Истина;
	Движения.ВводДанныхОРасходахКомпании.Очистить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВводДанныхГСМТранспорт.Транспорт,
	                      |	ВводДанныхГСМТранспорт.Транспорт.Марка.ТипГСМ,
	                      |	СУММА(ВводДанныхГСМТранспорт.РасходГСМ) КАК РасходГСМ
	                      |ПОМЕСТИТЬ ВТ_ТЧ
	                      |ИЗ
	                      |	Документ.ВводДанныхГСМ.Транспорт КАК ВводДанныхГСМТранспорт
	                      |ГДЕ
	                      |	ВводДанныхГСМТранспорт.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВводДанныхГСМТранспорт.Транспорт,
	                      |	ВводДанныхГСМТранспорт.Транспорт.Марка.ТипГСМ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ТЧ.Транспорт,
	                      |	ВТ_ТЧ.РасходГСМ * ВводДанныхГСМСтоимостьГСМ.Стоимость КАК СуммаРасход
	                      |ИЗ
	                      |	ВТ_ТЧ КАК ВТ_ТЧ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводДанныхГСМ.СтоимостьГСМ КАК ВводДанныхГСМСтоимостьГСМ
	                      |		ПО ВТ_ТЧ.ТранспортМаркаТипГСМ = ВводДанныхГСМСтоимостьГСМ.ТипГСМ
	                      |ГДЕ
	                      |	ВводДанныхГСМСтоимостьГСМ.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Рез = Запрос.Выполнить().Выбрать();					  
	СуммаРасход = 0;
	
	Пока Рез.Следующий() Цикл		
		СуммаРасход = СуммаРасход + Рез.СуммаРасход;		
	КонецЦикла;
	
	
	Если НЕ Отказ Тогда		
		Движение = Движения.ВводДанныхОРасходахКомпании.Добавить();
		Движение.Период = ДатаОтчета;
		Движение.СтатьяЗатрат = Справочники.СтатьиЗатратКомпании.ГСМ;
		Движение.ТипЗатрат    = Движение.СтатьяЗатрат.ТипЗатрат;
		Движение.ВидЗатрат = Перечисления.ВидыЗатратКомпании.РаспределяемыеРасходы;
		Движение.Сумма = СуммаРасход;	
	КонецЕсли;	
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда	
	
		Для каждого Стр Из Транспорт Цикл
			//Если Стр.РасходГСМ = 0 ИЛИ Стр.ПоказанияОдометраНаКонецДня = 0 Тогда
			Если Стр.ПоказанияОдометраНаКонецДня = 0 Тогда
				Сообщить("Есть строки с пустыми данными, документ не проведен");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;	
		
		
		// проверка на заполненность Типа ГСМ
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ВводДанныхГСМТранспорт.Транспорт.Марка КАК Марка,
		                      |	ВЫБОР
		                      |		КОГДА ЕСТЬNULL(ВводДанныхГСМТранспорт.Транспорт.Марка.ТипГСМ, ЗНАЧЕНИЕ(Справочник.ТипыГСМ.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ТипыГСМ.ПустаяСсылка)
		                      |			ТОГДА ИСТИНА
		                      |		ИНАЧЕ ЛОЖЬ
		                      |	КОНЕЦ КАК НеЗаполненТипГСМ
		                      |ИЗ
		                      |	Документ.ВводДанныхГСМ.Транспорт КАК ВводДанныхГСМТранспорт
		                      |ГДЕ
		                      |	ВводДанныхГСМТранспорт.Ссылка.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);		
		
		Рез = Запрос.Выполнить().Выбрать();
		
		Пока Рез.Следующий() Цикл		
			Если Рез.НеЗаполненТипГСМ Тогда		
				Сообщить("Для марки транспорта " + Рез.Марка + " не указан тип ГСМ");
				Отказ = Истина;			
			КонецЕсли;
		КонецЦикла;	
		
	КонецЕсли;					  
	
КонецПроцедуры
